src/cf/Catalogs/уатСценарииПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатСценарииПланирования</Name>
			<Comment>Сценарии планирования (уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатРазделыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПолучателиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКраткосрочноеПланирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьКраткосрочногоПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОперативноеПланирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиСоздаватьЗаказыНаТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиСоздаватьРазнарядкиНаВыпускТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьНомерПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДетализацияПланирования</Name>
					<Comment>Детализация планирования</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатДетализацияПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПланированиеПоГруппамУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаполненияВесаОбъемаГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланированиеОбъемовВПроцентах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланированиеВДнях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрезыПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазрезПланирования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатРазрезыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланированиеПоГруппам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантАналитики</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатВариантыАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазрезыПоказателейПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазрезПланирования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатРазрезыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланированиеПоГруппам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантАналитики</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатВариантыАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрВыработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/уатРазрезыПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатРазрезыПланирования</Name>
			<Comment>Разрезы планирования</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Колонна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараметрВыработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маршрут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправлениеПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Статья</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураТО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВариантыАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВариантыАналитик</Name>
			<Comment>Варианты аналитик</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодельТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринадлежностьТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Грузоотправитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Грузополучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маршрут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПунктОтправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПунктНазначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатьяДоходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатьяРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевозчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодЕТСНГ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодГНГ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатСценарииПланирования/Forms/ФормаВыбораРазрезовПланирования/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Раздел") Тогда
		ЗаполнитьСписокВыбораРазрезПланирования(Параметры.Раздел);
		Раздел = Параметры.Раздел;
	КонецЕсли;
	
	Если Параметры.Свойство("РазрезыПланирования") Тогда
		Для Каждого ТекСтрока Из Параметры.РазрезыПланирования Цикл
			НоваяСтрока = РазрезыПланирования.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Параметры.Свойство("ПараметрВыработки", ПараметрВыработки);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РазрезыПланированияРазрезПланированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элементы.РазрезыПланированияРазрезПланирования.СписокВыбора.Очистить();
	ДанныеВыбора = ПолучитьСписокВыбораРазрезПланирования(Раздел);

КонецПроцедуры

&НаКлиенте
Процедура РазрезыПланированияРазрезПланированияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	Конецесли;
	
	Элементы.РазрезыПланированияРазрезПланирования.СписокВыбора.Очистить();
	Элементы.РазрезыПланированияРазрезПланирования.СписокВыбора.Добавить(ВыбранноеЗначение);
	
	ТекущиеДанные = Элементы.РазрезыПланирования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.РазрезПланирования = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура РазрезыПланированияВариантАналитикиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	Конецесли;
	
	Элементы.РазрезыПланированияВариантАналитикиПредставление.СписокВыбора.Очистить();
	Элементы.РазрезыПланированияВариантАналитикиПредставление.СписокВыбора.Добавить(ВыбранноеЗначение);
	
	ТекущиеДанные = Элементы.РазрезыПланирования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ВариантАналитики = ВыбранноеЗначение;

КонецПроцедуры

&НаКлиенте
Процедура РазрезыПланированияВариантАналитикиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элементы.РазрезыПланированияВариантАналитикиПредставление.СписокВыбора.Очистить();
	
	ТекущиеДанные = Элементы.РазрезыПланирования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокРазрезов = ПолучитьСписокРазрезов(ТекущиеДанные.РазрезПланирования);
	ДанныеВыбора   = СписокРазрезов;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьРазрезы(Команда)
	
	мРазрезыПланирования = Новый Массив();
	
	Для Каждого ТекСтрока Из РазрезыПланирования Цикл 
		СтруктураЗаполнения = Новый Структура("РазрезПланирования, ВариантАналитики,
		|ПланированиеПоГруппам");
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, ТекСтрока);
		мРазрезыПланирования.Добавить(СтруктураЗаполнения);
	КонецЦикла;
	
	Закрыть();
	Оповестить("ВыборРазрезовПланированияСценария",
		Новый Структура("РазрезыПланирования, ПараметрВыработки", мРазрезыПланирования, ПараметрВыработки));
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораРазрезПланирования(Раздел)
	
	СписокВыбораРазрезПланирования = Элементы.РазрезыПланированияРазрезПланирования.СписокВыбора;
	СписокВыбораРазрезПланирования.Очистить();
	
	СписокВыбораРазрезПланирования.Добавить(ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Подразделение"));
	СписокВыбораРазрезПланирования.Добавить(ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Колонна"));
	СписокВыбораРазрезПланирования.Добавить(ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.ТС"));
	СписокВыбораРазрезПланирования.Добавить(ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.ВидПеревозки"));
	СписокВыбораРазрезПланирования.Добавить(ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Контрагент"));
	СписокВыбораРазрезПланирования.Добавить(ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Маршрут"));
	СписокВыбораРазрезПланирования.Добавить(ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.ОбъектСтроительства"));
	СписокВыбораРазрезПланирования.Добавить(ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.НаправлениеПеревозки"));
	СписокВыбораРазрезПланирования.Добавить(ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Договор"));
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокРазрезов(РазрезПланирования)
	
	СписокВыбораВариантАналитики = Новый СписокЗначений();

	Если РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.ТС") Тогда
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.ТС"));
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.ТипТС"));
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.ПринадлежностьТС"));
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.МодельТС"));
	ИначеЕсли РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Маршрут") Тогда
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.Маршрут"));
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.ПунктОтправления"));
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.ПунктНазначения"));
	ИначеЕсли РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Статья") Тогда
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.СтатьяДоходов"));
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.СтатьяРасходов"));
	КонецЕсли;
	
	Возврат СписокВыбораВариантАналитики;
КонецФункции

&НаСервере
Функция ПолучитьСписокВыбораРазрезПланирования(Раздел)
	
	СписокВыбораРазрезПланирования = Новый СписокЗначений;
	
	ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
		ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Подразделение"));
	ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
		ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Колонна"));
	ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
		ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.ТС"));
	ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
		ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.ВидПеревозки"));
	ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
		ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Контрагент"));
	ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
		ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Маршрут"));
	ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
		ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.ОбъектСтроительства"));
	ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
		ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.НаправлениеПеревозки"));
	
	Возврат СписокВыбораРазрезПланирования;
	
КонецФункции

&НаСервере
Процедура ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования, Раздел)
	
	СтрокиРазделов = РазрезыПланирования.НайтиСтроки(Новый Структура("РазрезПланирования", Раздел));
	Если СтрокиРазделов.Количество() = 0 Тогда
		СписокВыбораРазрезПланирования.Добавить(Раздел);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
